# -*- coding: utf-8 -*-
import scrapy
from scrapy import Request, Selector
from lxml import etree

# scrapy(twisted) 对极少数的某些网站返回的不规范 headers 无法正常处理，这里只是补丁代码，丝毫不会影响到正常代码。
def lineReceived(self, line):
    if line[-1:] == b'\r': line = line[:-1]
    if self.state == u'STATUS': self.statusReceived(line); self.state = u'HEADER'
    elif self.state == u'HEADER':
        if not line or line[0] not in b' \t':
            if self._partialHeader is not None:
                _temp = b''.join(self._partialHeader).split(b':', 1)
                name, value = _temp if len(_temp) == 2 else (_temp[0], b'')
                self.headerReceived(name, value.strip())
            if not line: self.allHeadersReceived()
            else: self._partialHeader = [line]
        else: self._partialHeader.append(line)
import twisted.web._newclient
twisted.web._newclient.HTTPParser.lineReceived = lineReceived

import re
import json
from urllib.parse import unquote, quote

class VSpider(scrapy.Spider):
    name = 'v'

    custom_settings = {
        'COOKIES_ENABLED': False,  # use my create cookie in headers
    }
    proxy = None # 'http://127.0.0.1:8888'

    def start_requests(self):
        def mk_url_headers(songer):
            def quote_val(url): return re.sub(r'([\?&][^=&]*=)([^&]*)', lambda i:i.group(1)+quote(unquote(i.group(2),encoding='utf-8'),encoding='utf-8'), url)
            url = (
                'https://www.90lrc.cn/so.php'
                '?wd={}'
            ).format(songer)
            url = quote_val(url)
            headers = {
                "accept-encoding": "gzip, deflate", # auto delete br encoding. cos requests and scrapy can not decode it.
                "accept-language": "zh-CN,zh;q=0.9",
                "accept": "text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8",
                "user-agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/68.0.3440.75 Safari/537.36"
            }
            return url,headers

        songers = [
            '曹格','宮野真守','男女对唱','小蓓蕾组合','薛之谦','老猫','龙梅子','刘惜君','DJ小可','齐秦','G.E.M.邓紫棋','李易峰','王菲','杨东煜','高姗','沙宝亮','许嵩','黄绮珊','胡新','张娜拉','炎亚纶',
            '秋裤大叔','俞灏明','张学友','陈学冬','西单女孩','孙子涵','汪苏泷','莫文蔚','郑国锋','马健涛','凤凰传奇','梁静茹','郁可唯','梁文音','飞轮海','龚琳娜','bobo','水木年华','BOBO','孙楠',
            '曾春年','丁当','韦礼安','小沈阳','李圣杰','pada','李娜','蔡妍','袁哲','许飞','陈乃荣','阎维文','胡灵','许绍洋','迪克牛仔','杨丞琳','S.H.E','张冬玲','郑源','s.h.e','蔡依林','郑嘉嘉','陶红','郭玲',
            '蔡卓妍','李宗盛','李佳璐','单色凌','六哲','魏晨','萧敬腾','阿悄','冷漠','慕容晓晓','张芸京','王啸坤','陈楚生','张震岳','关喆','娅琪朵','js','吴克群','陈星','泳儿','那英','欢子','乌兰托娅','周传雄',
            '林峰','张信哲','胡歌','李宇春','张敬轩','胡彦斌','Vae','JS','东来东往','杜奕衡','杨源顺','黄雅莉','姜玉阳','范玮琪','侃侃','by2','星弟','许巍','BY2','谭咏麟','郭静','By2','旭日阳刚','黄韵玲','祁隆',
            '韩雪','陈柏宇','杨千嬅','张韶涵','黄征','孙燕姿','后弦','斯琴高丽','王力宏','萧亚轩','至上励合','范逸臣','東方神起','A-Lin','黄丽玲A-Lin','a-lin','LeonardCohen','张小觉','杨子俊',
            '莫小娘','邓紫棋','林志炫','beyond','西野カナ','BEYOND','黄家驹','许茹芸','吴海飞','张杰','周杰伦','群星','周笔畅','陈奕迅','邓丽君','扎西平措','庄心妍','茜拉','宋祖英','凌飞','张国荣','杨梓',
            '阿摩司','林俊杰','乌兰图雅','刘德华','汪峰','苏仨','李幸倪','金南玲','崔子格','降央卓玛','陈慧娴','刀郎','马天宇','龚玥','李玉刚','王绎龙','华晨宇','陈百强','曼里','贾乃亮','李小璐','梁朝伟',
            '费玉清','孙俪','李健','张磊','霍尊','少儿歌曲','乐华七子NEXT','张国荣许冠杰','陈黎明','百慕三石','梁佳玉','任素汐','林忆莲','许冠杰','柴鑫茹','洪辰','谢安琪','许廷铿','刘珂矣','黑鸭子',
            '王源/贾乃亮/金瀚/杨超越','华人群星','夏天alex','杨坤','周迅','TFBOYS','tfboys','Tfboys','夏天Alex','甜馨','叶振棠','卡朋特','陈数','莫慧兰','EXO','梅艳芳','方大同','筷子兄弟',
            '蔡琴','孙露','李克勤','徐佳莹','赵浴辰','金池','曾一鸣','信乐团','叶丽仪','刘明辉','五月天','弦子','孟庭苇','陈小春','洪佩瑜','杨宗纬','张碧晨','蔡健雅','任飞扬','老狼','高安','梁博','雷婷',
            '左立','童安格','夏婉安','苏幻俊','慧心学園初等部女子ミニバスケットボール部5年生チーム','今生缘舞曲精选','许美静','玖月奇迹','曲婉婷','王杰','潘玮柏','罗力威','容祖儿','张靓颖',
            '黄艺明','阿宝','羽翘','萧风','蓝小野','StylipS','山下智久','孙盛希','CLIFFEDGE','杨洋','华语群星','裘海正','谭维维','林子祥','庞龙','唐明生','邝美云','杨钰莹','左宏元','田震','阿杜','金莎',
            '朴树','王二妮','胡大亮','Bigbang','赵雷','韩红','马健南','boy’z','陈柏霖','金志文','汤晓菲','陈慧琳','南征北战','Boy’z','郭采洁','BIGBANG','朱娜','Virgos室男社','腾格尔','T.H.P','薰妮',
            '乔维怡','回音哥','鹿晗','高胜美','陶喆','庾澄庆','满文军','郑伊健','徐小凤','mic男团','JPM','Jpm','MIC男团','陈冠希','刘菲','新街口组合','袁保强','张也','苏晴','袁野','自由鱼','C蓝','暴力东邪',
            '渔圈','24位群星','小荣','陈琳','叶奎','彭佳慧','牛奶咖啡','RADWIMPS','双孖JL','吴亦凡','李翊君','横颜君','陈咏','陈娇','董文华VS阎维文','westlife','赵传','李晓杰','辣妈点点','陈玉建',
            '蒙克','王梵瑞','张宇','Westlife','简弘亦','廖佳琳','云丹久美','孙邦楠','张振宇','桂纶镁','伍佰','何静','明圣凯','雨天','王若琳','二龙湖浩哥杜歌包池','杜歌','毛不易','ChinaBlue',
            '郭燕','何韵诗','龙凤之约','刘嘉玲','龙啸','陈美惠','MC天佑','大鹏','尚雯婕','羽泉','萌萌哒天团','Twins','正月十五','范晓萱','邰正宵','左小祖咒','左小祖咒,朱婧','苏勒亚其其格',
            '萨顶顶','欧阳菲菲','刘斌','韩安旭','东方红艳','陈嘉桦','云飞儿','童声合唱','周兴哲','封茗囧菌/双笙','成龙+金喜善','A-Teens','陈瑞','董贞','小曲儿','刘若英','儿童歌曲','成龙',
            'JasonWalker','林宥嘉James','大张伟','张丹峰','刘敏涛','林宥嘉','赵真','马建军','周华健','T-ARA','正云','T-ara','T-Ara','裴紫琦','东城卫','AJ张杰','彭佳慧/范玮琪','李宰镇','초아','Aoa',
            '何东','Ella','唐堉倩','AKB48チームサプライズ','杨清明','AKB48','Flower','FLOWER','AOA','苏辰骁','佐々木希','King小九','湘南乃風','韩永健','刘思杰（小A）王彦茹','柏木由紀','ナオト・インティライミ',
            'AGA','高旭','官恩娜','aiko','Aerosmith','简迷离','VK/五音Jw/Aki阿杰','音频怪物','凌之轩','完美仙剑','Walker','HITA','Aki阿杰','小爱的妈','富贵哥','梦岚','烟花','Akon','i2star','五色石南叶',
            '古巨基','阿兰','大庆小芳','安与骑兵','hita','安九','华研外语','AAA','EXO-M','艾丽雅','Alicia','光光','OddFuture','吴建豪','LeonaLewis','杨培安','AKB48FutureGirls','Amy妞儿','lie李俊杰Amy颖宝儿',
            '蓝蝶','阿ben','段千寻','安琪','angelababy','曾昱嘉','张栋梁','孙艳','Apink','许靖韵','angela','阿Ben','带泪的鱼','LanaDelRey','LMFAO','양요섭','정은지','谢霆锋','2PM','2pm','GILLE','ケツメイシ','奥云格日乐',
            '王麟','安可儿','安东阳','安又琪','dve东城','宝宝糖','安室奈美惠','少女时代','傲艺','云泉法师','安琥','苏七','小雨','陈兴瑜','小贱','袁娅维','AFTERSCHOOL','爱戴','爱新觉罗·阿南',
            '黑崎子','艾歌','艾尔肯','徐誉滕','阿原','阿丽玛','阿力木','蔡恒','AvrilLavigne','艾梦萌','艾斯卡尔','艾怡良','爱乐团','t.r.y','T.R.Y','宁静','戴爱玲','刘宗','阿木古楞','阿普萨萨','祖海',
            '陈仁鹤','本兮','谢军','艾薇儿','央金兰泽','阿木','徐良','戴佩妮','华子','爱朵女孩','阿力','来国庆','阿朵','阿权','阿正','杭娇','阿清','红布条','邓宁','阿爆','阿肆','高洪章','东方传奇','阿鲁阿卓',
            '熊七梅','B.A.P','倪安东','丁于','天使组合','阿牛','江若琳','何禹萱','阿桑·格莱鹏措','李佳薇','阿索','阿里郎','阴三儿','MC洪磊','遊助','阿桑·格来鹏措','徐志强','花姐','阿桑','陈文媛',
            'アンモフライト','司夏','BEJ48','spexial','LadyGaGa','ladygaga','Ladygaga','SpeXial','Spexial','钟洁','小凌','OliviaNewtonJohn','JKAI','君夜潼Benny','小倉唯','M.I.B','欧得洋','アンティック-珈琲店-',
            'BackToBedlam','刘心','CLUTCHO','東南','崔天琪','叶柔','大国男児','KAT-TUN','superjunior','金玟岐','野水いおり','fumika','CNBLUE','JunJack','芭比（bob）','浜崎あゆみ','叶倩文','网络歌手',
            '哭笑不得得得颖儿','K-bo','鱼尾纹','金希澈金长勋','ハナエ','TheBeatles','GD','TOP(中韩对照)','GReeeeN','少女時代','彭运铝','郑劲松','SHINee','王心凌','MichaelJackson','罗百吉',
            '黄义达','尼格买提·热合曼','小敏感','MayJ.','Eminem','AZU','eminem','廖国钺','八只眼','邓超','包贝尔','朱亚文','张心杰','宁可','苏航','麦客文强','北方狼','琼雪卓玛','成林江措','黄飞鹏',
            '吉祥三宝','谢和弦','tank','Tank','TANK','包娜娜','巴图','欣宝儿','张飞凡','曹芙嘉','冷酷','解晓东','陈绮贞','颖宝儿','布衣乐队','徐金慧','柏文','暴林','汤非柏文','板野友美','江美琪','姚瑶',
            'bii','波拉','慕寒','滨崎步','王彩桦','叫兽易小星,白客','卢冠廷','白燕升','王虹','江宇','毕夏','Bii','atiao','泽旺多吉','李维','廖名扬','白小白','白光','隆隆','云菲菲','郁钧剑','毕书尽','贺一航',
            '陈明','白玛多吉','永动机','甄佳','乔毓明','袁成杰','翁汕汕','合唱','EXO-SUHO','EXO-CHEN','陈思思','胡夏','格格','彭丽媛','张智成','李茂','白若溪','冯圣雅','小5','丁少华,白若溪','黄立行',
            'CL','鲍家街43号','鲍国','邬靖靖','朱永飞','林妙可','MC仁','厨房仔','李骏宇','阿妹妹','Mr.cat乐队','春晓','野仔','思小妞','JustinBieber','许哲佩','蔡旻佑','李文慧','吕莘','Phillips,Craig',
            'Dean','陶心瑶','倉木麻衣','郑融','储毅','汤加丽','侧田','KBShinya','代芙妮','双笙','崔京浩','刘诗诗','刘朋','常静','春雷','成泉','常石磊','刘子靖','晨熙','黄龄','李欣汝','央吉玛','川子','胡鸿钧',
            '王洋','田丹','青阳公社-崔浩然','唐妍','崔浩然','艾米','韩磊','张婧','常思思','姜牧言','林愔愔','万莉','曹方','曹越','门丽','王映山','郑绪岚','陈力','韩庚','曹轩宾','张书姚','屈海军','程琳',
            '草帽姐','李超','胡斌','程罕华','吾恩','龙千玉vs蔡小虎','蔡国权','李玲玉蔡国庆','蔡幸娟','黑撒','程响','silence.w','草蜢','程璧','蔡小虎','草原歌曲','魏君华','王昊','橙翼','苍井空',
            '蔡淳佳','蔡献华','淡菊','陈惠英','哈布尔','蔡国庆','天籁回音','蔡诗芸','超口爱乐团','赤龙','马旭成','陈一玲','迟志强','徐浩峻','孙洪亮','陈冠蒲','曾俊杰','连诗雅','陈升','钟镇涛','陈伟霆',
            '李治廷','周柏豪','陈势安','李晟','lollipopf@棒棒堂','陈坤','小宋佳','FirstGirl','陈天红','柯震东','陈妍希','余文乐','陈奂仁','陈晓','郑秀文','任伯儒','陈岩','陈彦允','红蔷薇','张雷',
            '小小浩','苏澈suretry','陈晓东','樱子','陈明真','苏打绿','星月组合','陈少华','筱冰雪','花树','张津涤','张小英','陈艺鹏','小山','陈燕妮','陈翔','陈艺搏','李蔓怡','陈粒','陈珊妮','陈洁仪',
            '陈美惠VS雷龙','毛阿敏','陈淑桦','陈燕','雷龙','陈赫','陈雅森','金久哲','陈鸿宇','Gling陈韵如','J.Digga刘书文','Jeff郑景仁','智涛','陈韵如','小右','何龙雨','贺世哲','王馨','龙奔',
            '张北北','牛国长','达坡玛吉','星君','福原美穂','周洁颖','叶圣涛','N’Gine','谢沛恩','tacica','DragonAsh','林一峰','东南','旅行团','赵丹','林依晨','张伦硕','梁佳杰','张卫健','林洪辉',
            '曹震豪','阿茹娜','方小菲','任贤齐','王雅洁','哈狗帮','徐磊','樱桃帮','南昌人','TOTALFAT','白晶','SamTsui','悠木碧','いとうかなこ','丹戈尔','OwlCity','LilWaynefeat.Drake','潘龙','丁爽',
            '丁可','丁紫','赵薇','大哲','李玲玉','刚辉','丁克森','丁丁','a-mac','球球','卓依婷','蓉儿','杨小曼','东方依依','刘恺名东方依依','东方神起','屠洪刚','动力火车','东浩舞真','单艺','代理仁',
            '单小源','胥拉齐','多亮','胡66','小琢','许佳慧','大喇叭组合','大喇叭组合（余润泽徐铵）','大嘴巴','蒋婴','磊磊','胡大亮单艺','木子','王小源','大张杰','东浩','大张雨','大来','钟舒祺',
            '任桂珍','刘大成','黄思婷','大星','小蛮','张启靓','王诗安','蝎子','孙悦','李果','德格叶','朱丹丹','荃戴','打扰一下乐团','戴娆','杜丽莎','樊凡','林忆莲杜德伟','杜新东','阎奕格','杜德伟',
            '周蕙','戴玉强','戴佳毅','周乔伟','张鹏飞Fay','杜雯媞','杜青','戴荃','周定纬','达明一派','童丽','司空雷','邓妙华','宋玉鹏','新白娘子传奇','蛋堡','路阳阳','董文华','杨幂','SS501','ss501',
            '邵大伦','段丽阳','奥迪','阿福（邓福如）','刘亦菲','邹兆龙','郑中基','邓超予','黄晓明','佟大为','王爱华','邓福如','E-girls','邓丽欣','何炅','藍井エイル','Ed.l','JAY’ED','东篱','硕官娘','田村ゆかり',
            'EXILE','ELISA','悟空','ediq','棒棒堂','南廾凡','芙蓉姐姐','ハジ→','萧人凤','Rihanna','何润东','Emma','ALTIMA','earthmind','LUHICA','miwa','hoquynhhuong','汪东成','DreamGirls','BREAKERZ',
            '梁凡','plenty','fripSide','FictionJunction','超新星','Eva袁攀','在夏天冬眠的猫','我的调调','袁攀','ayami','A-JAX','Coldplay','宋念宇','王硕．EviL','二兵','杨鸿宇FtHucky郑',
            '扬科','王硕','EGOIST','小W','梅朵','云の泣','M2M','二手玫瑰','二龙湖浩哥','谢容儿','北京国际儿童合唱团','朱贝贝','儿歌精选','s.h.e、周定纬','Girl2School','蒋大为','陶格斯','额尔古纳乐队',
            '李雪燕','温博','三浦大知','茅原実里','Noa','LinkinPark','GretchenWilson','河图','黄宇曛','B.zl轮子','平井大','Five.W','SMAP','Five.w','2AM','ナノ','王菲菲','中村舞子','林志颖','洛萱',
            'Varsity','Fool莫','槇原敬之','m-flo+daoko','石井竜也','JASMINE','Jasmine','鄭俊弘Fred','司文','郑少秋','Marigold','BRIGHT','路绮欧','马宁','松下優也','温岚','9mmParabellumBullet',
            '刘力扬','嵐','朱克','蓝心湄','吉杰','水樹奈々','江映蓉','Prizmmy☆','任静','付笛声','印能法师','付辛博','菩提子','付豪','纪晓斌','路勇','傅又宣','咪依鲁江','宝庆','林欣彤','冯允谦','Daisy×Daisy',
            '赵斌','舒淇','冯翔','反光镜乐队','冯光','冯曦妤','凤飞飞','富博洋','冯晓菲','孙浩','李彩桦','方力申','侯旭','单于轩/方妍','方季惟','方炯镔','方文琳','拉毛王旭','枫舞','晓依','路童','李慧珍',
            '李行亮','钟欣桐','方毅','毛方圆','泽宁','天籁天','懒春梦','枫桥','刘孟愉','福山雅治','范三妹','范冰冰','芳蓉','金蝴蝶','唐古','绿昕','樊少华','王旭鹏','周品','范思威','药小云','范海荣','戚薇',
            '范美','曹菲儿','品冠','艳菲儿','范琳琳','范忆堂','范文芳','干露露','大脸','贰婶','铁热沁夫','六仔','陈蔚','范宏伟','范小倩','王旭东','风语','曾经艺也','葛思然','少司命','贯诗钦','沙莎','朱紫娆',
            '严爵','牛欣欣','gala','麦烝玮','GALA','杨瑞代','OnlyJ','AK','Gentleman','MeloLv','给力小子','WakeUp,Girls!','仮面ライダーGIRLS','GLAY','SteelMagnolia','日笠陽子','CelticWoman',
            'Golden','JamieKennedy','G.NA','陈振威','Lead','周汤豪','光良','光泽','シド','李蔓怡关晓彤','关正杰','关承斌','关牧村','关泽楠','王晶莹','关菊英','关淑怡','关诗敏','冈林','关智斌','关楚耀',
            '欧豪','马思纯','关晓彤','陈飞宇','欧阳娜娜','邹元清','张诚航','关心妍','韩雪/关晓彤/王嘉/魏大勋/台风少年团','沫沫','悠悠','茶少','广智','果味VC','何龙雨孙语诺','魏俫','门丽VS胡小宝',
            '隋超','檀烧','曹敏','宋孟君格子兮','格子兮','威仔','格桑杰','果然哥','甘萍','罗秋红','梁佳邑','葛兰','葛仲珊','火红','歌浴森','皓天','沈凌云','车晓菲','周奕宏','江枫','张惠妹','小赏哥','葛小虎',
            '谷村新司','葛笑','郭兰英','郭力凡','梅朵措','郭富城','郭家铭','林心如','姚贝娜','贡尕达哇','张灵敏','郭美美','郭少杰','童丹','郭心雨','郭炳坚','郭慧敏','郭蓉','郭欢','孟刚','顾凯','郭峰',
            '顾小曼','王睿','顾龙','高少华','高慧君','高明骏容韵琳陈松伶汤非','李猛','高敏','高林生','黄渤','赞美之泉','司徒兰芳','高原天籁','汤潮','顾峰','顾莉雅','周深','斯琴高丽顾峰','高夫',
            '高凌风','聚点翻转','高海礁','周晏伊','高翊菲','王爵','马德钟','高进','高逸峰','民工开高达','io乐团','苏小花','Secret','中国娃娃','mihimaruGT','龚铭','高耀太','龚玥菲','大壮','青龙',
            '荷莉hari','阿拉丁','林希儿','大买麦乐团','BonnieRaitt','freeparty','张炜','何慧儿','MP魔幻力量','何晟铭','余润泽','何瑶','孙语诺','乱感觉','何流','何洁','侯延彬','后海大鲨鱼',
            '和田光司','嘿羽','塔琳','和汇慧','穆婷婷','哈琳锡林宝力日','哈琳','好妹妹乐队','哈辉','呼斯楞','MC诺','洪敬尧','1+1组合','罗志祥','快乐男声','杭天琪','河静静','墨明棋妙','刘洪杰',
            '洪卓立','洪杰','洪金宝','刘楚恬','浩轩','海鸣威','海镔','乔嘉','萧永（Jxv）','海生','火风','红蔷薇（傅蓉）','风之琳','易灵汐','胡丹丹','乌兰红梅','蓝琪儿','天生兄妹','小曾','洛天依','张豪',
            '谭耀文','徐申东','王强','胡伟立','胡兵','韩雷','胡东清','张轩铭','胡清蓝','豪图','马丹','花儿乐队','胡杨林','花粥','丁晓红','谭晶','胡建烽','衡越','师鹏','小爱与花儿乐队','贺宣','过江龙小鱼儿',
            '郝萌','霍勇','过江龙','修美娜','郝蕾','韩晓','唐嫣','罗晋','董卿','黃乙玲','卫飞鸿','韩晓军','韩宝仪','韩旭','刘和刚','霍建华','黄品源','黄勇','黄乙玲','黄乙玲迪克牛仔','黄勇/任浩铭',
            '赵鹏','黄凯芹','黄勇深','冰河','廖鸿飞','黄乙玲陈雷','心然','辛晓琪','黄建为','曾静玟','黄小琥','黄宗泽','钟嘉欣','郑欣宜','黄子韬','黄妃','吴琼','黄海波','旺姆','杨晓珊谷微','黄玠','黄红英',
            '黄琦雯','春天','孙红雷','黄磊','王迅','张艺兴','杨晓珊','黄灿','黄晶晶','梁龙/黄渤/沈腾','黄玠玮','刘思伟','黄芳（思雨豆）','黄莺莺','黄芳','黄美珍','黄耀明','黄贯中','黄阅','黄鹤翔',
            '黑涩会美眉','黑羽','甄妮','黑鸭子组合','汪明荃','黑龙','黑豹乐队','GrantMiller','安泽泽','乔亦思','TheChaser','黄伟成','Ivy文艺','Celeste','Lia','Infinite','INFINITE','Vimclip',
            'Schnuffel','schnuffel','IU','恺乐/鼓鼓/罗志祥','2Be3','徐怀钰','苏醒','朱婧佳','AsOne','McFly','范朋飞','卫兰','g.e.m邓紫棋','王若琪','美郷あき','Trident','福原香織','LarvalStagePlanning',
            'LARVALSTAGEPLANNING','IRiS七叶/馒头','IRiS七叶','冬子','齐栾','意意','清弄','小千','奇然','横颜','蛙蛙','沐雪琪yami','李安豪Ivan','Ivan张倾城','蚂蚁组合','孟文豪','ST☆RISH',
            'idolgirls','曲泉丞','enemy','JustinTimberlake','IVE','柯有伦','陈梓童','段家新','JUJU','jason.hong','jane静子','dve东城jane静子','齐晨','100%乐团','LotteGirls','B1A4','奥井雅美',
            'Fairies','lottegirls','高橋みなみ','乔洋','杨程钧','指人儿','K’jon','JOY','GRANRODEO','Juliet','仓木麻衣','九哲','徐环','李九龙','严当当','吉克隽逸','王亮','基地小虎','王东阳','娅琳',
            '张墨','寂悸','杨小琳（敬善媛）','丁童','JOKER（加藤和樹','伊達幸志）','月光畅想','フジファブリック','姜育恒','江一燕','江蕙','洪荣宏','伍思凯','江珊','钱琳','王志文','李谷一','江淑娜','周虹',
            '江智民','沙靖杰','清水翔太×加藤ミリヤ','江涛','姜鹏','皆大欢喜','胡俊铭','简红','孙青','蒋姗倍','J.Arie','蒋蒋','陈姿','蒋承龙','蒋卓嘉','经典老歌','纪佳松','毛泽少','江语晨','周宣','邱志都',
            '傅帅','胡月','酒疯','孙海洋','赵志刚','贾涛','王媛渊','解伟苓','蒋雪儿','金佩姗','金小鱼','金城','XIAHJunsu','耀乐团','达杰丁增','金润吉','易烊千玺','金熙泽','金海心','金泽','泡泡坊',
            '金佩珊','张柏芝','金琳','金美琪','金霖','张芯','音乐走廊','王如华','w.k','金贵晟','K.D.','阿央','K-2','陈佳','许艺娜','W.K','金波','沁心小筑','关颖','KOKIA','RO-KYU-BU!','KOTOKO','佐藤ひろ美',
            'Kara','KARA','井口裕香','KEITA','KG','Kalafina','高永泰','Kari','YURI＊KARI','黄蓝白','Simon','Garfunkel','Keane','Kellie凯莉','R.Kelly','于文文','徐真真','何野','Kent王健','kent','Lia/多田葵/Rita/茶太',
            '林雨','郭嘉俊','SimplePlan','kent王健','KenT','Kent','kenT','Kis-My-Ft2','匡萃龙','张谦卑','李建兴','陆宏志','群可','可歆','可泽','朱贺','佳利','咖啡音乐队','甘薇','咖啡因乐队','陈运子',
            '王俊凯','半阳','孔莹','花僮','柯以敏','张化勇','科尔沁夫','刘怡君','ピコ','王楚涵','快乐家族','康康','柯受良','Lenka','黎明','小尘埃','Lil’B','司良樱默','萌小兮','田美琪','Linda廖语晴',
            '吕雯','刘思涵','cc','CC','SE7EN','飞得鱼','刘尊','田峰','乐桐','张火','臧文','刘建东何怡','正歌','刘嘉亮','刘欢','岑雨桥','刘清沨','刘恺名','刘文正','刘洋','刘涛','张辉','刘雅丽','叶慧婷','卢巧音',
            '吕方','刘美麟','刘维','吕继宏','娄艺潇','吕珊','吕薇','吕研熙','刘美君','刘维刚','刘紫玲','刘瑞琦','李千娜','阎学晶','廖昌永','灰灰','李丹阳','杨澜','李冰冰','李宁','刘翔','曾轶可','李双江',
            '华谊群星','李代沫','李丽芬','旅行团乐队','李志洲','李思琳','王镇','袁和德','高维嘉','林凡','李殊','李承铉','朱桦','马郁','李琛','陈志昊','孟飞','赵鑫','杨臣刚','汪正正','徐誉腾','信','李琦',
            '李玟','李春波','安以轩','李琼','李雨儿','林宇中','章丽','钟汉良','李荣浩','安旭','李茂山','梁剑东','梁咏琪','彭兆成','李心洁','梁心颐','袁咏琳','梁一贞','张赫宣','林琳','林采欣','林育群',
            '王乐','梁紫丹','梁晓雪','梁雁翎','罗中旭','罗凯楠','梁琳','梁汉文','罗文','刘璇','老鹰乐队','罗时丰','张秀卿','广杰','珍美儿','零点乐队','梦然','魔幻力量','蓝波','罗大佑','黄子铭','林淑容',
            '蓝波大人','-金小乖+韩承+蓝波','唐俪','吴俊宏','江志丰','蓝雨','徐子崴雷佳','雷佳','雷安娜','雷光夏','魏如萱','张怡诺','龙飘飘','龙宽九段','Madonna','冷静,M.C.A','Mc井宁','米津玄師',
            'Mika','twenty4-7','MC井宁','M.CtheMax','庄冬昕','NS윤지','허영생','赵时','하동균','匀乔','拾音社','张提','Mario','杨凯琳','张继聪','misono','辽东笑笑生','微胖女神','马蕊','LimpBizkit','万芳',
            '张根硕','琴允寞','MISIA','冬雪','阿龙正刚','张真','Rihwa','烟花ShowHITA','孟小童','郭少杰杜歌孟刚','幂雅','易欣','孟杨','王源','朱晓琳','明玥','慕容萱','孟楠','朱之文','moumoon','任然',
            '明道','未知','後弦','孟小笛','KingStar','kingstar','王思远','梅少民','木子烁','兰卡措','Kingstar','毛俊杰','毛宁','毛宁、杨钰莹','莫艳琳','美衫儿','A-Lina莉','CRITTY','朱丹','谢娜',
            '向年历','蘑菇兄弟','蒙面哥','杨竣杰','莫露露','张嘉宸','周占超','苗伟','傅振辉龙千玉','张蓉蓉','马丽','馒头','迈克尔·杰克逊','蜜雪薇琪','苗苗','蔡丽妮','马山虎','马博','马智宇',
            '云朵','马旭成梁海洋','汪茜','马海生','金睿璘','马頔','马条','周艳泓','马旭东','玄鸟传说','王馨平麦子杰','麦洁文','东方红艳赵真','TimMcGraw','马晓梦','B-Zion','BritneySpears',
            '廖浩明','ClariS','DoubleD,BigDaddy','ViViD','渡り廊下走り隊7','乃木坂46','蓝宇','倪梓悠','刘江洪','倪新宇','倪尔萍','Annabel','乔杨','倪雅丰','李创','西游乐队','南拳妈妈','南宫嘉骏',
            '南方二重唱','南风','杨语莲','南妮','南合文斗','曾强','崔岩','宁新兵','牛朝阳','含笑','刘天','牛歌','沈嫔嫔','根呷','宁桓宇','娜仁齐齐格','农夫','聂琳峰','纳兰张天赋','阿里木郎','塚本八雲（能登麻美子）',
            '纳兰珠儿','锁心玉','那仁朝格','张可儿','那我懂你意思了','费翔','贾盛强','冰弦','那些花儿','张沛沛','那日松','吴若希','OLDCODEX','ONE☆DRAFT','矢井田瞳','陈明憙','网络歌曲',
            '塩ノ谷早耶香','BiS','鈴木このみ','雷磊','朱兴东','小柳ゆき','张立昂','AshesRemain','中川翔子','丁娜','窦靖童','许慧欣','李魏西','王大文','季小薇','greysonchance','GreysonChance',
            '李日詹','罗马','欧汉声','LilWayne','罗云熙','欧弟','欧恒','欧阳俊','蔡晓','徐千雅','欧阳青','Psy','泫雅','安心亚','赵奕欢','欧阳靖','中島美嘉','V6','林子曦','香香','RAINBOW','何曼婷','Usher',
            'Tommyfebruary6','橋本みゆき','罗卿','Beata阿贝','でんぱ組.inc','施佩希','大眼炮','性感的拖鞋','坡上村','帕尔哈提','平原綾香','张倾城','任妙音','彭三','彭丽丽','约瑟翰','庞麦郎',
            'W.K.','w.k.','平井堅','杨千桦','彭丽嘉','庞晓宇','彭亮','彭博','郑茜匀','彭坦','彭健新','王宗尧','凌晗','彭伟家','佩希','黄圣依','彭筝','孙彭飞','彭野新儿歌','平安','彭高平','彭青','丁香晓晓',
            '朴信惠/张根硕/9thstreet','朴慧京','秦勇','彭钧','江凯文','彭野','彭羚','彭清','潘安邦','潮流','潘广益','潘艺','杨雪晴','潘军','潘艺翔','派伟俊','潘美辰','吴丹妮','潘越云','潘迪华',
            '刘庭羽','蒲巴甲','潘辰','theGazettE','X-TIE','潘裕文','7朵花183Club','乔冬宇','刘芳','乔军','中国梦之声-吴佳琳','丘羽特','自画像乐队','乔任梁','吴海燕','崔健','七朵','七朵花',
            '七朵组合','乔晨','乔治','王梓蘅','乔玲儿','乔献华','暴林乔玲儿','乾国科','勤琴','山野','前田敦子','区瑞强','其其格玛','千百顺','李玥铭','释则旭','李潇潇','苏夏','千百惠','青铜假面',
            '囚鸟','自然卷','奇然、CRITTY','屈慧','张山合唱团','庆吉','李瑞凝','骆驼强子','卓文萱','庆庆','巧千金','崎君','呼延玳每','Braska','奇然liya/沈谧仁','奇力格尔阿丽玛','王嬞儿',
            '阿波','曾静','藤兮','俊昊','曲丹','田馥甄','汤非曲丹','才娜旺姆','曲尔甲','曲旦卓玛','曲桐雨','曲慧','彝人制造','冰痕深影','王觉','权振东','谢有才','清响','重小烟','涵昱','焦庆军','誓言',
            '清水咲斗子','君の横颜[十五夜]','清漪','次仁桑珠','任重','邓洁琼','清水翔太feat.仲宗根泉','祁松涛','清莞','清清儿','清春','清水翔太','子曰秋野','秋裤兄弟','秦岚','さかいゆう',
            '秦御峰','柯言','秦永','秦浩','涓子','秦博','石杨','winky诗','吴杨雨','孙浪','秦齐','邱付权','毛慧','代悦','雨蝶','Winky诗','酒吧伤心人','邱小龙','十一','邱永传','向银莹','邱琳雅','袁小迪','孙豪',
            '李明洋','青春老少年','陈思安','青春美少女','青山黛玛','钱红','裂天','183Club','齐峰','青青凉','齐亚男','齐豫','齐霖','歌一生','王铮亮','齐旦布','青鸟飞鱼','吴雨霏','SA.RI.NA','妙佳薇',
            'spike阿锋','易桀齐','Rain','Ray','w-inds.','卢广仲','StevieHoang','BENI','李承哲','夏后','陈晓露','蓝色军团','罗艺恒','曹雷','冰阳','马晨昱','AYABIE','王瑞淇','Robynn','Kendy','LaLaLa(feat.GhostStyle)',
            'm80','robin','李亮超','東京女子流','查可欣','peridots','任军太','任和','張心柔','任娟','西单女孩（任月丽）','任承浩','Sara','任盈盈','任芳','Selina（任家萱）','任家萱','rill','Rill',
            'Selina','容中尔甲','任雪晨','若惜','JAMOSA','楚博仁','赵红军','饶天亮','赵蓉儿','熊音乐团-奶牛','SISTAR','SNH48','Snh48','党好','bump.y','sara','秀兰玛雅','家家','SARA','高橋優','Gero',
            '花澤香菜','れみfromSTAR☆ANIS','三代目JSoulBrothers','川嶋あい','LiSA','lisa','安田レイ','Smile小千','蓝又时','王子建','suede','sum稣','Sum稣','刘程伊','Sweety','张芯瑜','sweety',
            '刘品言','刘丹萌','伤感一哥','上官红燕','王小娟','常石磊，孙伯纶，于超颖，霍尊，郭一帆','杨萍','王建荣','幺健','孙博','孙家山','孙国庆','艺凡','孙中亮','李泽坚','杨刚','十三狼',
            '孙艺玲爱华','孙耀威','宋晓峰','包池','宋靖宇','孙豆尔','孙辉','宋飞','宋茜','DJ','孙晓磊','孙伯纶','孙艺玲','孙浩雨','宿雨涵','山楂妹（张月乔）','陈一凡','山下達郎','少女时代-太蒂徐',
            '山楂妹','时翔云','斯兰','手嶌葵','帅霖','桑田佳祐','斯琴格日乐','桑吉平措','车神','时嘉','沈波','陈心蕊','石雪峰','李倩','索南扎西','索朗扎西','神木与瞳','景甜','沈雁','郑家维','钟舒曼',
            '苏富权','苏小明','苏永康','卓韵芝','苏月','苏有朋','苏盈之','王基飞','石梅','苏慧伦','吴青峰','丢丢','邵洪/A-Lim','顺子','晨悠组合','苏运莹','王乐乐','邵洪','陈依然','苏麦','晴天美眉',
            '钟舒漫','Tom-H@ckfeaturing大石昌良','富永TOMMY弘明','璐宇tony','陈央','access','Train','周程成','黄鸿升','唐薇','堂娜','唐禹哲','杨亮','顾静','金虹汝','唐磊','唐涛','郑晓填',
            '王维倩','张峰','汤非','汤唯','王晰','汤非王莉','汤灿','严艺丹','石燕鹏','田一龙','多情哥','田亮','万沛鑫','王柯达','亓航','李明明','常艾非','痛苦的信仰','田培良','田蕊妮','胡杰夕','木童',
            '童彤','雪人组合','toto怀旧','北岛诗','孙晓哲','童波','海阔','刘茂雄','谭艳','戴灿','赵雪阳','陶晶晶','陶晶莹','齐一','U-KISS','EP','季秋洋','鬼宝','牧师师','黒崎真音','U-Kiss','张小建','UNIQ',
            'UNLIMITS','亮先生','Takamiy','ULTRA-PRISM','何鹏','キム・ヒョンジュン','小琨','shelly佳','瞳','奶兮兮Rely','JessieBaylin','℃-ute','CODE-V','SuperGirls','VIXX','DEEP','VaVa','A.B.C-Z',
            '지기펠라즈(JiggyFellaz)','veary','Veary','李晗','董霏霏','真理絵','陈思元','喜多村英梨','SKE48','陈娟儿','Vitas','衣湿','贝若德华','罗心洁','FooFighters','多田宏','韩帅兵','宜璇',
            'CharliXCX','酷爱乐团','乌兰齐齐格','火勒','于洋','吴京','王梓旭','吴品醇','吴奇隆','吴彦凝','吴文煜','吴汶芳','吴琴儿','杨静','吴彤','吴浩康','刘浩龙','陈惠琳','张健','吴莫愁','末希',
            '吴静','巫启贤','钟亚华','李炜/汪小敏','无印良品','赵文静','汪小敏','汪明荃II','王亚平','汪明荃郑少秋','望海高歌','王丽达','汤子星','温兆伦','王亚民','红笛','王冰洋','王凯','王叙然',
            '汪睿','王博文','王可','月亮','王奕心','王浩','徐一鸣','姜涛','王娟','哨音传情','王娅','王子鸣','王子月','王宏伟','王宏恩','王建宁','王心雅','王心如','忢訫','王少平','王宝强','张国强','王宝强/熊乃瑾',
            '王思思','王欣婷','覃飞宇','苏诗丁','王晓敏','侯歌','刘阳','刘牧','李瑾','万一','王建房','王璐岢','王璐瑶','王祖蓝','王婧','李恩羽','陈明达','刘诗豪','王蓉','樊琪','陈麟','王菀之','王萌','晓月',
            '王萌黎','赤雪','荣联合','代慧颖','王莉','王童语','王筝','王翌鑫','赵天野','欧姐','王野','王键','王青、冯建宇','火山','王馨平','王韵壹','王语心','王鹤铮','韦嘉','魏如昀','小雪','魏紫祺','魏菲儿',
            '魏新雨','魏佳艺','王鸣飞','夏天播放','夏兰','兴子','孝天','张艺骞','钟氏兄弟','夏韶声','JoeyTang','陈依婷','小伟','小丫','苏小麦','胡小宝','mxd小宝','王佳东','小宝','小寺可南子','许培军',
            '小旭音乐','小昔米','校长/小来哥/徐钰昆','小臭臭','赤い公園','小老头','小田和正','刘小琢','冯提莫','沈春阳','石焱','柳为（VitaminVC）','引月兮','小贱星弟','小虫','小虎队','xun',
            'Xun','正月十五组合','石晋铭','徐嘉苇','徐洁儿','韩星洲','徐小明','郑观松','班杰明','朱梓骁','孙羽幽','徐泽','吕念祖','徐晶晶','刘心灵','恒苏','徐子崴','陈宏元','新裤子','曾黎','李俊旭',
            '刘依纯','旭日阳刚刘刚','欣哲','星君（孙猛）','陶钰玉','熊天平','侯懿航','Marina杨洋熊天平','熊大','宋炫舞','张睿','7!!','周显','玄觞','熊木杏里','宇桐非','王菲儿','熊汝霖','晓枫',
            '肖丹','肖开提','李草青青','肖家永','肖洋','紫烟如韵','肖玄','萧煌奇','林健辉','笑天','冷漠张冬玲','肖亮','萧磊','魏晓雪','张云雷','萧闳仁','迟重瑞','何国禧','西域胡杨','邓岚','许嘉文',
            '桑吉','林宝','许强','魑魅九儿','谢世超','谢天笑','sigma','谢天华','徐子珊','许魏洲','谢东裕','许鹤缤','许志安','谢帝','谢浛露','廿四味','邢天溯','辛柔','谢雨欣','苏贤文','YUI','yui','羽·泉',
            '张启靓贝若德华','谢艺','YOYO超人','一绫','소녀시대','于夫','果宝酱','张可儿严龙','于晋','李筝','于文华','于晓鸥','李清坡','福耳','于淼','于金胜','银临','Riyo','于青','云非非','伊穆','伊能静',
            '南鹤','伊藤由奈','李炳辰','余天','陈俞静','叶凡','叶世荣','原子霏','hotcha','叶文辉','咏咏','叶蓓/许巍','姚笛','谢珊','央金卓嘎','央金卓玛','叶顺有','小琪','孜龙叶顺有','叶蓓','小柯',
            '叶贝文','/w.k.','姚苏蓉','尹洪强','尤静波','岳云鹏/郭麒麟','宇海文','幼稚园杀手','尤国通','尹相杰','胡蒎','娜日','刘伟','阿雅','岳云鹏','金世佳','大平','李维真','MCHotDog','王家宇',
            '摇滚女王','霓裳','杨乃文','杨义','余枫','杨姣','杨子姗','薛凯琪','陈意涵','杨嘉松','杨孟茜','刘恺威','王羽泽','杨峰','冷漠杨小曼','杨光','夏毅','杨乐乐','神经领袖','杨海彪','杨浩龙','于浩宸',
            '杨栋梁','杨林Jerome','杨林','杨林枫','杨梓琪','杨洪基','杨朗朗','老猫(龙猫组合)','杨帆','潘阳','杨烁','杨茜茜','Swin','永邦','杨青倩','游子组合','杨炅翰','殷秀梅','沈小岑','张胜淼',
            '罗钢','杨蔓','曾杨茜','牙牙乐','赵泓绅','登格尔','大左','赵楠','覃沐曦','袁姗姗','韩栋','赵又廷','袁成杰、戚薇','随歌飘洒（张翠萍）','言承旭','游鸿明','三宝','杨正强','袁泉','Tacke竹桑',
            '江南诚','湘齐萌','焦天扬','李丹','雨霖枫','雨中百合','音爵','陈红','雅萱','寒武纪','刘子菲','柔情','李俊霖','浪花兄弟','文可','lie李俊杰','颜培珊','李俊杰颖宝儿','OliviaOng','卓玛旺姆',
            '周子琰','周冰倩','汪东城','馨予','周晓鸥','周慧敏','高斌','成骏','大小百合','周燕君','周渝民','庄妮','张兵','张含韵','暴林张咪','张地','张姚','张友殿','张咪','张寒','张强','小青岛','张希晨',
            '阚杰','张天龙','张咸宁','杨川平','武艺','张悬','张恒远','张惠春','张智霖','张曼玉','张明敏','张正扬','张洪量','bigbrother','付梦妮','姚婷','张瑶','翁立友','张紫瑶','江志丰张秀卿','百合二重唱',
            '张玮','张煜枫','丹堂夏草','张玮玮','张蔷','cam乐队','张铭峰','张镐哲','苏彦霏','梦晓','张雨生','扎西顿珠','朱一龙','安悦溪','CAM乐队','白宇','曾沛慈','张远喆','张铠麟','俊毅','朱雅','朱逢博',
            '甄秀珍','自由发挥','赞美之泉音乐事工','紫海','赵乃吉','赵咏华','HIGH4','云霞','朱明瑛','朱明','阿如娜','沈梦辰','赵泳鑫','赵照','赵英俊','吕冰冰','缝纫机乐队','赵腾','夏筠怡','赵霏儿',
            '郑冰冰%Braska','郑冰冰','郑志立','郑希怡','郑恺','沈丹丹','钟欣潼','钟立风','郑智化','韩禹希','魏然','贾宗超','2R','2女','朱婧','1983组合','1+3组合','WK','702','小远','4minute','佚名','梁君诺',
            '佟铁鑫','佟丽娅','陈思诚','朵朵','Takamiywithつるの剛士','高露','尹春吉','小峰峰','萧全','阿幼朵','王春江','StLeonards','坂本冬美','堀江由衣','坂本真綾','小潘潘/小峰峰','婷汐',
            '曾子岚','林二汶','岑宁儿','晏敏敏','昊麟','李姗殷','斉藤和義','余婷','晟瑶','向日葵梦幻演唱组','周子寒','沢井美空','汉洋','阿睿凌霓剑裳/nl不分','苏勒亚琪琪格','潇梦临',
            '玺晨','琪淇姐妹','北科大学子','艾丽娅琪琪格','潇峰','绯村柯北','璐菲','琪琪格','吉岡亜衣加','褚海辰+皓天','褚海辰','覃浩','轲然','覃晔','贲小伟','孤心泪','胡艾莲','萱萱','刘萱萱',
            '菅野洋子','晓雨','廖芊芊','臧天朔','天孪兄弟','廖钰涵','闫旭','那依辰','季小璐','阚立文','闫薇薇','邬祯琳','钰涵','马钰涵','鏡音レン','镜音双子','Nerufeat.鏡音リン','三千院ナギ','綾崎ハヤテstarring釘宮理恵',
            '白石涼子',
            ]
        for songer in songers:
            d = {}
            d['songer']  = songer
            url,headers = mk_url_headers(songer)
            meta = {}
            meta['proxy'] = self.proxy
            meta['_plusmeta'] = d
            r = Request(
                    url,
                    headers  = headers,
                    callback = self.parse,
                    meta     = meta,
                )
            yield r
            # break

    def parse(self, response):
        _meta = response.meta.get('_plusmeta') or {}
        for r in self.parse_list(response):
            yield r

        def mk_url_headers(page):
            url = response.url + '&page={}'.format(page)
            headers = {
                "accept-encoding": "gzip, deflate", # auto delete br encoding. cos requests and scrapy can not decode it.
                "accept-language": "zh-CN,zh;q=0.9",
                "accept": "text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8",
                "user-agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/68.0.3440.75 Safari/537.36"
            }
            return url,headers

        number = response.xpath('//div[@class="ss"]/span').extract()[0]
        number = int(re.findall(r'共搜索到(\d+)首歌词信息', number)[0])
        pages = number//6+1 if number/6 > number//6 else number//6
        for page in range(1, pages+1):
            url,headers = mk_url_headers(page)
            meta = {}
            meta['proxy'] = self.proxy
            meta['_plusmeta'] = {**_meta}
            r = Request(
                    url,
                    headers  = headers,
                    callback = self.parse_list,
                    meta     = meta,
                )
            yield r

    def parse_list(self, response):
        _meta = response.meta.get('_plusmeta') or {}
        for x in response.xpath('//li[contains(text(), "歌词名称：")]/a'):
            hafurl = x.xpath('./@href').extract()[0]
            title  = x.xpath('./text()').extract()[0]
            href = response.urljoin(hafurl)
            def mk_url_headers(href):
                headers = {
                    "accept-encoding": "gzip, deflate", # auto delete br encoding. cos requests and scrapy can not decode it.
                    "accept-language": "zh-CN,zh;q=0.9",
                    "accept": "text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8",
                    "user-agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/68.0.3440.75 Safari/537.36"
                }
                return href,headers
            url,headers = mk_url_headers(href)
            d = {}
            d['title'] = title
            d['href']  = url
            meta = {}
            meta['proxy'] = self.proxy
            meta['_plusmeta'] = {**_meta, **d}
            r = Request(
                    url,
                    headers  = headers,
                    callback = self.parse_lrc,
                    meta     = meta,
                )
            yield r

    def parse_lrc(self, response):
        _meta = response.meta.get('_plusmeta') or {}
        lrc = response.xpath('string(//*[@id="lrc"])').extract()[0].replace('\r\n', '\n')
        def mk_url_headers(href):
            href = href.replace('/geci', '/gequ')
            headers = {
                "accept-encoding": "gzip, deflate", # auto delete br encoding. cos requests and scrapy can not decode it.
                "accept-language": "zh-CN,zh;q=0.9",
                "accept": "text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,image/apng,*/*;q=0.8",
                "user-agent": "Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/68.0.3440.75 Safari/537.36"
            }
            return href,headers
        url,headers = mk_url_headers(response.url)
        meta = {}
        meta['proxy'] = self.proxy
        meta['_plusmeta'] = {**_meta, 'lrc':lrc}
        r = Request(
                url,
                headers  = headers,
                callback = self.parse_song_src,
                meta     = meta,
            )
        yield r

    def parse_song_src(self, response):
        d = response.meta.get('_plusmeta') or {}
        d['src'] = response.xpath('//*[@id="player"]/@src').extract()[0]
        # import pprint
        # pprint.pprint(d)
        yield d


# 配置在单脚本情况也能爬取的脚本的备选方案，使用项目启动则下面的代码无效
if __name__ == '__main__':
    import os, time
    from scrapy.crawler import CrawlerProcess
    timestamp = time.strftime("%Y%m%d_%H%M%S", time.localtime()) # 年月日_时分秒
    filename = 'v{}.json'.format(timestamp) # 这是输出文件名字（解开 'FEED_URI' 配置注释生效）
    jobdir   = 'JOBDIR/rAtjkevZqV'          # 这是队列信息地址（解开 'JOBDIR'   配置注释生效）

    p = CrawlerProcess({
        'TELNETCONSOLE_ENABLED':    False,        # 几乎没人使用到这个功能，直接关闭提高爬虫启动时间
        'MEDIA_ALLOW_REDIRECTS':    True,         # 允许图片下载地址重定向，存在图片下载需求时，请尽量使用该设置
        # 'LOG_LEVEL':                'INFO',       # DEBUG , INFO , WARNING , ERROR , CRITICAL
        # 'JOBDIR':                   jobdir,     # 解开注释则增加断点续爬功能
                                                  # 任务队列、任务去重指纹、任务状态存储空间(简单来说就是一个文件夹)
        'FEED_URI':                 filename,   # 下载数据到文件
        'FEED_EXPORT_ENCODING':     'utf-8',    # 在某种程度上，约等于 ensure_ascii=False 的配置选项
        # 'FEED_FORMAT':              'json',     # 下载的文件格式，不配置默认以 jsonlines 方式写入文件，
                                                  # 支持的格式 json, jsonlines, cvs, xml, pickle, marshal
        # 'DOWNLOAD_DELAY':           1,          # 全局下载延迟，这个配置相较于其他的节流配置要直观很多
    })
    p.crawl(VSpider)
    p.start()
